{
  "scriptMethods" : [ "print", "sleep" ],
  "selectedAuto" : "C:\\Users\\varun\\Documents\\GitHub\\FRC-2022\\src\\main\\deploy\\autos\\shootandmovelower.json",
  "selectedShooterConfig" : "shooterconfig.json",
  "teamNumber" : 3476,
  "robotLength" : 0.9398,
  "robotWidth" : 0.9398,
  "pointScaleFactor" : 159.96748,
  "originX" : -601.0,
  "originY" : -1080.0,
  "pathingConfig" : {
    "maxVelocityMetersPerSecond" : 3.0,
    "maxAccelerationMetersPerSecondSq" : 2.0,
    "trajectoryConstraints" : [ {
      "type" : "CentripetalAccelerationConstraint",
      "maxCentripetalAccelerationMetersPerSecondSq" : 2.032
    }, {
      "type" : "SwerveDriveKinematicsConstraint",
      "kinematics" : {
        "wheelsMeters" : [ {
          "x" : 0.30797,
          "y" : 0.307975
        }, {
          "x" : -0.307975,
          "y" : 0.307975
        }, {
          "x" : 0.307975,
          "y" : -0.307975
        }, {
          "x" : -0.307975,
          "y" : -0.307975
        } ]
      },
      "maxSpeedMetersPerSecond" : 3.0
    } ]
  },
  "networkTablesEnabled" : false,
  "robotCodeDataFile" : "robotCodeData.json",
  "useReflection" : true,
  "isHolonomic" : true,
  "readMe" : "the scriptMethods contains the list of valid methods that will be allowed in the script block. print and sleep are currently hardcoded to allow for error checking on the arguments. You to edit them you will need to clone & compile the code. You can find them at src/me/varun/autobuilder/scripting/parser. selectedAuto & selectedShooterConfig point to the files that the code will read to get and save data. The team number is used for connect to your robot though network tables. The robot length and width are in meters and is used to draw the blue box when clicking on a point. The point scale factor is calculated by getting the (length and pixels of the field in the image)/(length of the field in meters). It is used to render everything in the correct position. The units for the origin is in pixels. It represents how much the image should be translated so that (0,0) in the application space is (0,0) on the image. You can disable network tables by setting networkTablesEnabled to false. This is useful if you are using the app while not connected to the robot and are getting lag spikes/errors in the console"
}